Repository: mobile-power/EBC-controller
Catalog: locale/ebcc.*.po
Languages: de

source: Compiled
de: Kompiliert

source: This version %s supports the A20 as well as the A40.
de: Diese Version %s unterstützt auch den A20 und den A40.

source: enhanced version
de: erweiterte Version

source: A GUI Software for Linux (and Windows) to control ZTE Tech EBC series battery testers and electronic loads intailly written by %s
de: Eine Grafische Benutzeroberfläche für Linux (und Windows) zur Steuerung der ZTE EBC Serie von Batterietestern. Die Software wurde ursprünglich von %s geschrieben.

source: command expected
de: Kommando erwartet

source: comment not closed, } missing
de: Nicht abgeschlossener Kommentar, } erwartet

source: end of line expected
de: Zeilenende erwartet

source: = expected
de: = erwartet

source: parameter %s does not support a value
de: Der Parameter %s unterstützt keinen Wert

source: parameter name expected
de: Parametername erwartet

source: parameter name or value expected
de: Parametername oder Wert erwartet

source: / expected
de: / erwartet

source: unable to add alias, "%s" not found
de: Alias kann nicht hinzugefügt werden, "%s" nicht gefunden

source: unable to convert "%s" to a number
de: "%s" kann nicht in eine Zahl konvertiert werden

source: value expected
de: Wert erwartet

source: AutoLog is defined but neither a log file name nor Auto CSV Filename is specified
de: Autolog ist aktiviert aber weder ist ein Dateiname angegeben noch ist Auto CSV Dateiname aktiviert

source: Charge current (%fA) exceeds the maximum supported by %s (%fA)
de: Der Ladestrom (%fA) übersteigt den maximal möglichen Ladestrom vom %s(%fA)

source: Charge current (%fA) is lower than cutoff current (%fA)
de: Der Ladestrom (%fA) ist kleiner als der Abschaltstrom (%fA)

source: Charge voltage (%fV) exceeds the maximum supported by %s (%fV)
de: Die Ladespannung (%fV) übersteigt die maximal mögliche Ladespannung vom %s(%fA)

source: Connected
de: Verbunden

source: Connecting...
de: Verbinde...

source: Connection Lost
de: Verbindung wurde getrennt

source: Unable to connect - timeout
de: Keine Verbindung möglich - Zeitüberschreitung

source: unable to copy %s to %s
de: Kann %s nicht in %s kopieren

source: Current
de: Strom

source: Set the charge/discharge current in Ampere
de: Ladestrom für Laden/Entladen in Ampere

source: Cutoff current (%fA) is greater or equal to charage current (%fA)
de: Abschaltstrom (%fA) ist größer oder gleich Ladestrom (%fA)

source: DecodeCurrent raised %s (%2x%2x)
de: DecodeCurrent Ausnahmefehler %s (%2x%2x)

source: DecodeVoltage raised %s (%2x%2x)
de: DecodeCurrent Ausnahmefehler %s (%2x%2x)

source: Discharge current (%fA) exceeds the maximum supported by %s (%fA)
de: Entladestrom (%fA) überschreitet den maximalen Ladestrom vom %s (%fA)

# main.cedit
source: Edit...
de: Bearbeiten...

source: Error
de: Fehler

source: Error %d while closing logfile)
de: Fehler %d beim schließen der Logdatei

source: %s while reading Model= from %s (Section %d)
de: %s beim lesen von Model aus %s (Sektion %d)

source: Fatal Error
de: Fataler Fehler

source: File Exists
de: Datei vorhanden

source: file %s already exists Overwrite File ?
de: Datei %s ist bereits vorhanden, Überschreiben ?

source: Ident for model %d not found in %s
de: Ident für Modell %d nicht gefunden in %s

source: <%s invalid checksum
de: <%s ungültige Prüfsumme

source: No charge/discharge profiles defined in configuration file (%s)
de: Es keine Lade/Entladeprofile in der Konfigurationsdatei (%s) definiert

source: no charging profile selected
de: Keine Ladeprofil ausgewählt

source: There is no connect packet defined in configuration file (%s)
de: Kein "connect" Paket definiert in der Konfigurationsdatei %s

source: There is no disconnect packet defined in configuration file (%s)
de: Kein "disconnect" Paket definiert in der Konfigurationsdatei %s

source: No models defined in configuration file (%s)
de: Keine Modelle in der Konfigurationsdatei (%s)

source: Not connected
de: Nicht Verbunden

source: packet "%S" not found in config file
de: packet "%S" nicht in der Configdatei gefunden

source: Timout waiting for a packet from charger device
de: Zeitüberschreitung bei Warten auf Paket vom Gerät

source: Power
de: Leistung

source: Set the charge/discharge Power in Watt
de: Einstellungen der Lade/Entladeleistung in Watt

source: Resistance
de: Widerstand

source: Set the charge/discharge current resistance in Ohm
de: Wert für Laden/Entladen mit konstantem Widerstand

source: Set border name
de: Fensterüberschrift setzen

source: started
de: gestartet

source: unable to create step logfile %s (%d)
de: Step-Logdatei konnte nicht angelegt werden %s (%d)

# main.ctime
source: Time
de: Zeit

source: Unable to connect to %s
de: Verbinden mit %s fehlgeschlagen

source: unable to create logfile %s (%d)
de: Logdatei %s konnte nicht angelegt werden (%d)

source: unknown
de: unbekannt

source: View...
de: Ansicht...

source: &Autoload program file
de: Step-Datei &automatisch laden

source: &Force monitor mode after cycle end
de: Monitor-Mode nach beenden aktivieren

source: &Ignore CRC
de: CRC &Ignorieren

source: Load last settings
de: Letzte Einstellungen laden

source: &Log received data to console
de: Empfangende Daten in &Konsole anzeigen

source: Remember &CSV file for automatic logging
de: &CSV Dateiname für automatisches Logging speichern

source: &Remember save directory
de: Log-&Verzeichnis speichern

source: Remember s&tep file directory
de: &Step-Datei Verzeichnis speichern

source: use taskbar name as csv file name &prefix
de: Taskbar Namen vor den csv Dateinamen stellen

source: Use default settings
de: Standardeinstellungen verwenden

source: Use selection 2
de: Verwende Einstellung 2

source: Use selection 3
de: Verwende Einstellung 3

# shortcuthelpform.csk_connect
source: Connect
de: Verbinden

source: Data
de: Daten

source: Run
de: Starten / Beenden

# shortcuthelpform.csk_settings
source: Settings
de: Einstellungen

source: Steps / Program
de: Schritte

# shortcuthelpform.csk_title
source: Shortcut keys
de: Tastaturkürzel

source: Values
de: Werte

source: Add wait
de: Wait hinzufügen

source: capacity
de: Kapazität

source: Charge current not specified (curr=)
de: Ladestrom (curr=) nicht spezifiziert

source: Charge voltage not specified in script nor in conf file (volt=)
de: Ladespannung nicht im Script und nicht in der Conf-File angegeben (volt=)

source: Command expected
de: Kommando erwartet

source: current
de: Strom

source: Cutoff current not specified (cuta=)
de: Abschaltstrom nicht angegeben (cuta=)

source: Note: A20 and A40 requires charging voltage (chargers have no presets like A5 and A10), may be set via ini file e.g. for LiPo
de: Hinweis: A20 und A40 benötigen Ladespannung (diese haben keine Voreinstellungen wie A5 und 10), kann auch in der ini-Datei, z.B. für LiPo angegeben werden

source: energy
de: Energie

source: Error in script file
de: Fehler in Scriptdatei

source: Examples:
de: Beispiele:

source: Invalid integer number: %s
de: %s ist keine gültige ganze Zahl

source: (Line %d, Column %d): %s
de: (Zeile %d, Spalte %d): %s

source: Loop value already specified
de: Loop-Wert wurde bereits angegeben

source: minutes
de: Minuten

source: unexpected command
de: Unerwartetes Kommando

source: unexpected parameter for charge
de: Ungültiger Parameter für Laden

source: unexpected parameter for discharge (%s)
de: Ungültiger Parameter für Entladen (%s)

source: unexpected parameter for discharge current power (%s)
de: Ungültiger Parameter für Entladen mit konstanter Leistung (%s)

source: unexpected parameter for discharge current resistance(%s)
de: Ungültiger Parameter für Entladen mit konstantem Widerstand (%s)

source: unexpected parameter for loop
de: Ungültiger Parameter für LOOP

# stepform.cunsaved
source: Unsaved
de: Nicht gespeichert

source: Wait time in seconds:
de: Wartezeit in Sekunden:

source: About
de: Über

# tfrmconnect.cancelbutton.caption
source: Cancel
de: Abbrechen

# tfrmconnect.caption
source: Connect
de: Verbinden

source: &Device
de: &Port

source: Adjust
de: Anpassen

# tfrmmain.btnprog.caption
source: Edit...
de: Bearbeiten...

source: Edit the current script, load one or create a new one <F12>
de: Bearbeiten des aktuellen Scripts , ein Script laden oder ein neues erstellen <F12>

source: Skip step
de: Schritt überspringen

source: Abort the current step and continue with the next one <F11>
de: Aktuellen Schritt überspringen und mit nächstem fortfahren <F11>

source: Start charge,discharge or program
de: Laden, Entladen oder Schritte starten

# tfrmmain.chart.axislist[1].title.caption
source: Time
de: Zeit

source: If the charge current will be lower than the cutoff current, charging will be stopped
de: Beenden wenn der Ladestrom den angegebenen Endstrom unterschreitet

source: End charge/discharge after the specified energy in AH has been put into or get from the battery
de: Laden/Entladen beenden wenn die angegebene Energie in AH erreicht ist

source: End charge/discharge after the specified energy in WH has been put into or get from the battery
de: Laden/Entladen beenden wenn die angegebene Energie in WH erreicht ist

source: Current step:
de: Aktueller Schritt:

source: after
de: nach

source: Log separator
de: Trennzeichen

# tfrmmain.label3.caption
source: Cutoff Voltage
de: Endspannung

# tfrmmain.lblcells.caption
source: Ce&lls
de: Ze&llen

# tfrmmain.lblchargev.caption
source: &Voltage
de: S&pannung

source: C&utoff current
de: Endstrom

source: Cutoff Capacity
de: Endkapazität

# tfrmmain.lblcutenergy2.caption
source: Cutoff energ&y
de: Endenergie

# tfrmmain.lblcuttime.caption
source: Max time (min)
de: Max Zeit (Min)

source: &minutes
de: &Minuten

source: Testing
de: Teste

source: Step
de: Schritt

source: cmd
de: Kommando

# tfrmmain.memsteplog.columns[4].title.caption
source: Time
de: Zeit

source: Start voltage
de: Startspannung

source: End voltage
de: Endspannung

source: End current
de: Endstrom

source: D&ata
de: D&aten

# tfrmmain.mmm_file.caption
source: &File
de: &Datei

source: &Help
de: &Hilfe

source: La&nguage
de: Sprache

source: S&ettings
de: Einstell&ungen

source: S&teps
de: &Schritte

source: &About
de: &Über ebcc

source: Auto CSV &Filename
de: Auto CSV Dateiname

source: Toggle CSV auto log file naming
de: Umschalten der automatischen Benennung der CSV-Logdatei

source: &Connect
de: &Verbinden

source: Connect to charger
de: &Verbinde mit Gerät

source: &Disconnect
de: &Trennen

source: Disconnect from charger
de: Verbindung zum Gerät trennen

source: English (en)
de: Englisch (en)

source: Set CSV log file &directory
de: Logdateiverzeichnis einstellen

source: &Quit
de: &Beenden

source: Save to &CSV
de: Speichern als &csv

source: Save to &png
de: Speichern als &png

source: Set CSV log &file
de: CSV Logdateinamen einstellen

source: &Settings
de: &Einstellungen

source: Open settings
de: Einstellungen öffnen

source: &Shortcuts
de: Ta&ststaturkürzel

source: Skip Step
de: &Schritt abbrechen

source: Abort the current step and continue with the next one
de: Aktuellen Schritt abbrechen und mit nächstem fortfahren

source: Edit Stepfile
de: Schrittdatei &ändern

source: Load Stepfile
de: Schrittdatei &laden

source: Set Taskbar &Name
de: Fenster&überschift setzen

source: Steps: Scripted charge and discharge cycles
de: Schritte: Script für gesteuerte Lade- und Entladezyklen

source: (no file)
de: (keine Datei)

source: Toggle monitor mode, showing current voltage and current while not charging or discharging
de: Umschalten Monitor-Mode, Anzeigen aktuelle Spannung/Strom wenn Laden/Entladen nicht aktiv ist

source: Charge
de: Laden

source: Charge - Ctrl F1
de: Laden - Strg F1

source: Console
de: Konsole

source: Console - Ctrl F4
de: Konsole - Strg F4

source: Discharge
de: Entladen

source: Discharge - Ctrl F2
de: Entladen - Strg F2

source: Steps
de: Schritte

source: Steps - Ctrl F3
de: Schritte - Strg F3

# tfrmsettings.cancelbutton.caption
source: Cancel
de: Abbrechen

# tfrmsettings.caption
source: Settings
de: Einstellungen

source: &Misc settings
de: &Weitere Einstellungen

source: &dVdA Int. time (s)
de: &dVdA Int. Zeit (s)

source: Parameters
de: Parameter

source: &Startup behavior
de: &Startverhalten

# tfrmshortcuts.caption
source: Shortcut keys
de: Tastaturkürzel

# tfrmstep.caption
source: Unsaved
de: nicht gespeichert

source: Devic&e:
de: &Port:

# tfrmstep.menuitem1.caption
source: &File
de: &Datei

source: CC discharge
de: Entladen Konstantstrom

source: CP discharge
de: Entladen Konstantleistung

# tfrmstep.mniadd.caption
source: &Add
de: &Hinzufügen

source: &Exit
de: &Beenden

source: &New
de: &Neu

source: &Open
de: &Öffnen

source: &Save
de: &Speichern

source: Save &As...
de: Speichern &unter...

# tfrmstepadd_loop.cancelbutton.caption
source: Cancel
de: Abbrechen

source: Add loop
de: Loop Hinzufügen

source: &Loop count:
de: Anzahl loops:
